/* ЗАДАЧА 1 Время активности объявлений
 *  Фильтрует аномальные значения и оставит id объявлений с корректными значениями
 * 
 */
-- Определим аномальные значения (выбросы) по значению перцентилей:
WITH limits AS (
    SELECT  
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY total_area) AS total_area_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY rooms) AS rooms_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY balcony) AS balcony_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY ceiling_height) AS ceiling_height_limit_h,
        PERCENTILE_DISC(0.01) WITHIN GROUP (ORDER BY ceiling_height) AS ceiling_height_limit_l
    FROM real_estate.flats     
),
-- Найдём id объявлений, которые не содержат выбросы:
filtered_id AS(
    SELECT id
    FROM real_estate.flats  
    WHERE 
        total_area < (SELECT total_area_limit FROM limits)
        AND (rooms < (SELECT rooms_limit FROM limits) OR rooms IS NULL)
        AND (balcony < (SELECT balcony_limit FROM limits) OR balcony IS NULL)
        AND ((ceiling_height < (SELECT ceiling_height_limit_h FROM limits)
            AND ceiling_height > (SELECT ceiling_height_limit_l FROM limits)) OR ceiling_height IS NULL)
    ),
-- Выведем объявления без выбросов:
filtred_all as(
	SELECT
		f.id,
		CASE
			WHEN f.city_id = '6X8I' THEN 'Санкт-Петербург'
			ELSE 'ЛенОбл' 
		END AS region, -- категоризуем по городам
		CASE
			WHEN a.days_exposition >=1 AND a.days_exposition <=30 THEN '1. Месяц'
			WHEN a.days_exposition >=31 AND a.days_exposition <=90 THEN '2. Квартал'
			WHEN a.days_exposition >=91 AND a.days_exposition <=180 THEN '3. Полгода'
			WHEN a.days_exposition >=181 THEN '4. Более полугода'
			ELSE null 
		END AS period_activ, -- категоризуем по периоду активности
		a.last_price/f.total_area AS price_area, -- стоимость 1 кв.м
		f.total_area, -- общая площадь
		f.rooms, -- кол-во комнат
		f.balcony, -- кол-во балконов
		f.floor, -- этаж продаваемой недвижимости
		f.floors_total -- кол-во этажей в доме
	FROM real_estate.flats as f
	JOIN real_estate.advertisement a using(id)
	WHERE f.id IN (SELECT * FROM filtered_id)
		AND f.type_id ='F8EM' -- Рассматриваем только города
)
select 
	region, -- регион
	period_activ, -- период активности
	count(id) AS count_id, -- кол-во объявлений
	round(avg(price_area)::numeric,4) avg_price_area, -- средняя стоимость стоимость 1 кв.м
	round(avg(total_area)::NUMERIC,4) AS avg_total_area, -- средняя площадь
	PERCENTILE_disc(0.5) WITHIN GROUP(ORDER BY rooms) AS perc_room, -- медиана кол-ва комнат
	round(avg(rooms)::NUMERIC,3) AS avg_rooms, -- среднее кол-во комнат
	PERCENTILE_disc(0.5) WITHIN GROUP(ORDER BY balcony) AS perc_balcony, -- медиана кол-ва балконов
	round(avg(balcony)::NUMERIC,3) AS avg_balcony, -- среднее кол-во балконов
	percentile_disc(0.5) WITHIN GROUP(ORDER BY floor) AS perc_floor, -- медиана этажа продаваемой недвижимости
	round(avg(floor)::NUMERIC,3) AS avg_floor, -- среднее значение этажа продаваемой недвижимости
	round(avg(floors_total)::NUMERIC,3) AS avg_floors_total -- среднее значение этажей в доме
FROM filtred_all
WHERE period_activ is NOT null
GROUP BY region, period_activ
ORDER BY region DESC, period_activ asc;
/* Время активности объявлений в Санкт_петербург и ЛенОбл
region         |period_activ     |count_id|avg_price_area|avg_total_area|perc_room|avg_rooms|perc_balcony|avg_balcony|perc_floor|avg_floor|avg_floors_total|
---------------+-----------------+--------+--------------+--------------+---------+---------+------------+-----------+----------+---------+----------------+
Санкт-Петербург|1. Месяц         |    2168|   110568.8847|       54.3799|        2|    1.865|         1.0|      1.068|         5|    6.561|          12.093|
Санкт-Петербург|2. Квартал       |    3236|   111573.2397|       56.7072|        2|    1.917|         1.0|      1.010|         5|    6.880|          12.598|
Санкт-Петербург|3. Полгода       |    2254|   111938.9221|       60.5508|        2|    2.031|         1.0|      0.949|         5|    6.539|          12.037|
Санкт-Петербург|4. Более полугода|    3581|   115457.2249|       66.1530|        2|    2.172|         1.0|      0.915|         5|    6.290|          11.620|
ЛенОбл         |1. Месяц         |     397|    73275.2471|       48.7233|        2|    1.753|         1.0|      1.066|         4|    4.423|           8.028|
ЛенОбл         |2. Квартал       |     917|    67573.4320|       50.8834|        2|    1.885|         1.0|      0.957|         3|    4.157|           7.373|
ЛенОбл         |3. Полгода       |     556|    69846.3945|       51.8315|        2|    1.896|         1.0|      0.920|         3|    4.121|           7.420|
ЛенОбл         |4. Более полугода|     890|    68297.2192|       55.4118|        2|    2.022|         1.0|      0.896|         3|    3.910|           6.908|
*/


/* ЗАДАЧА 2 Сезонность объявлений
 *  Фильтрует аномальные значения и оставит id объявлений с корректными значениями
 * 
 */
-- Определим аномальные значения (выбросы) по значению перцентилей:
WITH limits AS (
    SELECT  
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY total_area) AS total_area_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY rooms) AS rooms_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY balcony) AS balcony_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY ceiling_height) AS ceiling_height_limit_h,
        PERCENTILE_DISC(0.01) WITHIN GROUP (ORDER BY ceiling_height) AS ceiling_height_limit_l
    FROM real_estate.flats     
),
-- Найдём id объявлений, которые не содержат выбросы:
filtered_id AS(
    SELECT id
    FROM real_estate.flats  
    WHERE 
        total_area < (SELECT total_area_limit FROM limits)
        AND (rooms < (SELECT rooms_limit FROM limits) OR rooms IS NULL)
        AND (balcony < (SELECT balcony_limit FROM limits) OR balcony IS NULL)
        AND ((ceiling_height < (SELECT ceiling_height_limit_h FROM limits)
            AND ceiling_height > (SELECT ceiling_height_limit_l FROM limits)) OR ceiling_height IS NULL)
    ),
-- Выведем объявления без выбросов:
filtred_all as(
	SELECT 
		f.id AS id,
		a.last_price/f.total_area AS price_area, -- стоимость 1 кв.м
		f.total_area AS total_area, -- общая площадь
		EXTRACT ('month' FROM a.first_day_exposition) AS first_day, -- выделяем месяц подачи объявления
		EXTRACT ('month' FROM a.first_day_exposition + days_exposition::integer) AS last_day -- выделяем месяц снятия объявления
	FROM real_estate.flats as f
	FULL JOIN real_estate.advertisement a using (id)
	WHERE f.id IN (SELECT * FROM filtered_id)
		AND f.type_id ='F8EM' -- Рассматриваем только города
		AND EXTRACT(YEAR FROM a.first_day_exposition::timestamp) >= 2014 -- определяем диапазон рассматриваемых лет
		AND EXTRACT(YEAR FROM a.first_day_exposition::timestamp) <= 2019
),
up_adv AS ( -- распределение объявлений по месяцу подачи объявления
	SELECT 
		first_day AS month_adv, -- месяц
		count(id) AS c_id, -- кол-во объявлений
		ROW_NUMBER() over(ORDER BY count(id) DESC) count_rank, -- место меяца по кол-ву объявлени
		round(avg(price_area)::numeric,4) avg_price_area, -- средняя стоимость стоимость 1 кв.м
		round(avg(total_area)::NUMERIC,4) AS avg_total_area -- средняя площадь
	FROM filtred_all
	WHERE first_day>0
	group BY first_day
),
down_adv as( -- распределение объявлений по месяцу снятия с продаж
	SELECT 
		last_day AS month_adv, -- месяц
		count(id)  AS c_id, -- кол-во объявлений
		ROW_NUMBER() over(ORDER BY count(id) DESC) count_rank, -- место меяца по кол-ву объявлени
		round(avg(price_area)::numeric,4) avg_price_area, -- средняя стоимость стоимость 1 кв.м
		round(avg(total_area)::NUMERIC,4) AS avg_total_area -- средняя площадь
	FROM filtred_all
	WHERE last_day>0 
	group BY last_day
)
SELECT 
	u.month_adv, -- месяц
	u.count_rank AS up_count_rank, -- ранг по кол-ву подачи объявлений
	d.count_rank AS down_count_rank, -- ранг по кол-ву снятия с продажи объявлений
	u.c_id AS up_count, -- кол-во поданных объявлений
	round(u.c_id::numeric/(SELECT count(*) FROM filtred_all ),4) AS up_to_all_count, -- доля поданых объявлений от общего еколичества объявлений
	d.c_id AS down_count, -- кол-во снятых объявлений
	round(d.c_id::numeric/(SELECT count(*) FROM filtred_all ),4) AS down_to_all_count, -- доля снятых объявлений от общего еколичества объявлений
	round(d.c_id::NUMERIC/u.c_id,4) AS finish_count, -- отношение завершенных объявлений к снятым
	u.avg_price_area AS up_avg_price_area,
	d.avg_price_area AS down_avg_price_area,
	u.avg_total_area AS up_avg_total_area,
	d.avg_total_area AS down_avg_total_area
FROM up_adv as u
JOIN down_adv AS d using (month_adv)
ORDER BY u.month_adv;
/* Распределение объявлений по месяцам
month_adv|up_count_rank|down_count_rank|up_count|up_to_all_count|down_count|down_to_all_count|finish_count|up_avg_price_area|down_avg_price_area|up_avg_total_area|down_avg_total_area|
---------+-------------+---------------+--------+---------------+----------+-----------------+------------+-----------------+-------------------+-----------------+-------------------+
        1|           11|              5|    1017|         0.0635|      1268|           0.0792|      1.2468|      106835.9220|        105120.9682|          58.9558|            57.6672|
        2|            1|             10|    1737|         0.1085|      1128|           0.0704|      0.6494|      106452.0169|        104032.8222|          60.3396|            60.4717|
        3|            2|              4|    1675|         0.1046|      1276|           0.0797|      0.7618|      107320.4868|        107554.4337|          59.4087|            59.4458|
        4|            3|              1|    1638|         0.1023|      1420|           0.0887|      0.8669|      108450.8350|        105892.6692|          59.9717|            58.2336|
        5|           12|             12|     929|         0.0580|       750|           0.0468|      0.8073|      103510.6878|        100356.5176|          59.2044|            57.4903|
        6|            7|             11|    1224|         0.0764|       782|           0.0488|      0.6389|      104802.1514|        101912.7822|          58.3732|            60.1917|
        7|            9|              9|    1149|         0.0717|      1130|           0.0706|      0.9835|      104488.9586|        102505.1091|          60.4237|            59.0429|
        8|            8|              8|    1166|         0.0728|      1145|           0.0715|      0.9820|      107034.7005|        100056.8381|          58.9873|            56.9751|
        9|            6|              6|    1341|         0.0837|      1247|           0.0779|      0.9299|      107563.1201|        104397.1237|          61.0375|            57.7544|
       10|            5|              2|    1437|         0.0897|      1367|           0.0854|      0.9513|      104065.1093|        104608.7038|          59.4333|            58.9072|
       11|            4|              3|    1589|         0.0992|      1307|           0.0816|      0.8225|      105468.2328|        103882.3463|          60.0297|            56.8713|
       12|           10|              7|    1112|         0.0694|      1179|           0.0736|      1.0603|      106768.3159|        105712.6340|          60.8944|            59.3857|
 */

/* ЗАДАЧА 3 Анализ рынка недвижимости Ленобласти
 *  Фильтрует аномальные значения и оставит id объявлений с корректными значениями
 * 
 */
-- Определим аномальные значения (выбросы) по значению перцентилей:
WITH limits AS (
    SELECT  
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY total_area) AS total_area_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY rooms) AS rooms_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY balcony) AS balcony_limit,
        PERCENTILE_DISC(0.99) WITHIN GROUP (ORDER BY ceiling_height) AS ceiling_height_limit_h,
        PERCENTILE_DISC(0.01) WITHIN GROUP (ORDER BY ceiling_height) AS ceiling_height_limit_l
    FROM real_estate.flats     
),
-- Найдём id объявлений, которые не содержат выбросы:
filtered_id AS(
    SELECT id
    FROM real_estate.flats  
    WHERE 
        total_area < (SELECT total_area_limit FROM limits)
        AND (rooms < (SELECT rooms_limit FROM limits) OR rooms IS NULL)
        AND (balcony < (SELECT balcony_limit FROM limits) OR balcony IS NULL)
        AND ((ceiling_height < (SELECT ceiling_height_limit_h FROM limits)
            AND ceiling_height > (SELECT ceiling_height_limit_l FROM limits)) OR ceiling_height IS NULL)
    ),
-- Выведем объявления без выбросов:
filtred_all as(
	SELECT
		f.id,
		c.city,
		a.days_exposition,
		a.last_price/f.total_area AS price_area, -- стоимость 1 кв.м
		f.total_area, -- общая площадь
		f.rooms, -- кол-во комнат
		f.balcony, -- кол-во балконов
		f.floor, -- этаж продаваемой недвижимости
		f.floors_total -- кол-во этажей в доме
	FROM real_estate.flats as f
	JOIN real_estate.advertisement a using(id)
	JOIN real_estate.city c using (city_id)
	WHERE f.id IN (SELECT * FROM filtered_id)
		AND f.city_id <> '6X8I'
)
select 
	city, -- регион
	count(id) AS count_adv, -- кол-во объявлений
	round(count(id) FILTER (WHERE days_exposition>0)/count(id)::NUMERIC*100,3) ||'%' AS finish_adv, -- доля снятых объявлений
	DENSE_RANK() over(ORDER BY count(id) FILTER (WHERE days_exposition>0)/count(id)::NUMERIC desc) finish_adv_rank, -- ранг по снятым объявлениям
	round(avg(price_area)::numeric,4) avg_price_area, -- средняя стоимость стоимость 1 кв.м
	DENSE_RANK() over(ORDER BY avg(price_area)  desc) avg_price_area_rank, -- ранг по средней стоимости 1кв.м
	round(avg(total_area)::NUMERIC,4) AS avg_total_area, -- средняя площадь
	DENSE_RANK() over(ORDER BY avg(total_area)  desc) avg_total_area_rank, -- ранг по средней площади
	round(avg(days_exposition)::NUMERIC,4) AS avg_days_exp, -- средняя продолжительность публикаций
	DENSE_RANK() over(ORDER BY avg(days_exposition)  asc) avg_days_exp_rank -- ранг по продолжительности публикаций
FROM filtred_all
GROUP BY city
ORDER BY count(id) DESC;
/* Активность в Лен. области среди городов с численностью больше 100 объявлений
city                   |count_adv|finish_adv|finish_adv_rank|avg_price_area|avg_price_area_rank|avg_total_area|avg_total_area_rank|avg_days_exp|avg_days_exp_rank|
-----------------------+---------+----------+---------------+--------------+-------------------+--------------+-------------------+------------+-----------------+
Мурино                 |      568|93.662%   |              7|    85968.3770|                 11|       43.8597|                204|    149.2068|               91|
Кудрово                |      463|93.737%   |              6|    95420.4732|                  8|       46.1960|                176|    160.6290|              104|
Шушары                 |      404|92.574%   |             11|    78831.9266|                 21|       53.9331|                 73|    152.0374|               92|
Всеволожск             |      356|85.674%   |             36|    69052.7882|                 44|       55.8262|                 53|    190.1148|              137|
Парголово              |      311|92.605%   |             10|    90272.9633|                  9|       51.3383|                106|    156.2083|              100|
Пушкин                 |      278|83.094%   |             43|   104158.9388|                  3|       59.7409|                 37|    196.5671|              144|
Гатчина                |      228|89.035%   |             23|    69004.7383|                 45|       51.0201|                111|    188.1133|              135|
Колпино                |      227|92.070%   |             13|    75211.7294|                 26|       52.5521|                 95|    147.0144|               90|
Выборг                 |      192|87.500%   |             28|    58669.9854|                 71|       56.7644|                 49|    182.3274|              131|
Петергоф               |      154|88.312%   |             26|    85412.4804|                 12|       51.7697|                101|    196.5662|              143|
Сестрорецк             |      149|89.933%   |             20|   103848.0860|                  4|       62.4452|                 30|    214.8134|              156|
Красное Село           |      136|89.706%   |             21|    71972.2829|                 36|       53.2021|                 83|    205.8115|              151|
Новое Девяткино        |      120|88.333%   |             25|    76879.0665|                 24|       50.5199|                120|    175.6509|              125|
Сертолово              |      117|86.325%   |             31|    69566.2579|                 42|       53.6174|                 78|    173.5842|              121|
Бугры                  |      104|87.500%   |             28|    80968.4073|                 17|       47.3487|                166|    155.9011|               99|
-----------------------+---------+----------+---------------+--------------+-------------------+--------------+-------------------+------------+-----------------+
Волхов                 |       87|78.161%   |             49|    34912.3343|                187|       50.2529|                125|    164.3529|              112|
Ломоносов              |       87|91.954%   |             14|    71811.8882|                 37|       50.8943|                115|    229.5500|              164|
Кингисепп              |       84|91.667%   |             15|    47107.3928|                119|       52.9598|                 91|    125.4675|               75|
Никольское             |       80|86.250%   |             32|    57492.9813|                 72|       42.1553|                221|    237.1449|              171|
Сланцы                 |       79|83.544%   |             41|    18110.4250|                269|       48.3481|                154|    173.6667|              122|
Кронштадт              |       70|90.000%   |             19|    79824.3920|                 18|       54.7157|                 66|    159.4603|              103|
Коммунар               |       66|84.848%   |             39|    57352.9127|                 75|       48.7736|                145|    236.2857|              170|
Янино-1                |       64|85.938%   |             34|    70972.9828|                 39|       48.4545|                151|    116.8545|               68|
Старая                 |       58|86.207%   |             33|    65615.3267|                 54|       53.6976|                 77|    167.1800|              116|
Тосно                  |       58|93.103%   |              9|    58804.1488|                 69|       53.8034|                 74|    163.5370|              110|
Сосновый Бор           |       54|87.037%   |             29|    73937.5997|                 30|       53.6000|                 79|     85.4468|               43|
Отрадное               |       53|75.472%   |             51|    56862.1113|                 78|       53.7623|                 75|    204.7750|              148|
-----------------------+---------+----------+---------------+--------------+-------------------+--------------+-------------------+------------+-----------------+
Кировск                |       49|85.714%   |             35|    57482.7206|                 73|       46.5712|                173|    154.1429|               94|
Тихвин                 |       46|82.609%   |             44|    39798.3588|                154|       48.9250|                143|     97.1842|               51|
Кириши                 |       44|79.545%   |             48|    41023.7141|                146|       47.3795|                165|     91.3429|               48|
Приозерск              |       37|72.973%   |             54|    38984.2470|                157|       51.2054|                107|    227.4074|              160|
Луга                   |       34|85.294%   |             37|    40356.2554|                149|       53.0912|                 85|    129.5517|               77|
Стрельна               |       34|97.059%   |              2|    88007.1558|                 10|       50.7529|                118|    195.6061|              141|
Шлиссельбург           |       34|91.176%   |             17|    61154.6453|                 60|       50.3941|                122|    264.0645|              183|
Металлострой           |       34|91.176%   |             17|    74004.4091|                 29|       51.5859|                103|    100.6774|               55|
Романовка              |       31|93.548%   |              8|    55769.5217|                 83|       48.4484|                152|    162.2759|              108|
Свердлова              |       31|96.774%   |              3|    60909.8281|                 62|       53.0277|                 88|     89.0667|               46|
Павловск               |       30|86.667%   |             30|    84366.6107|                 13|       58.2200|                 43|    268.1154|              186|
Новоселье              |       28|85.714%   |             35|    74094.9515|                 28|       49.0679|                140|    134.8333|               80|
Рощино                 |       27|85.185%   |             38|    59177.8283|                 67|       55.9189|                 52|    155.8696|               98|
Волосово               |       26|92.308%   |             12|    40843.6239|                148|       49.5904|                133|    310.2500|              201|
Тельмана               |       25|88.000%   |             27|    72601.0847|                 33|       57.0160|                 48|    170.9545|              118|
Сиверский              |       23|91.304%   |             16|    44047.4269|                132|       52.3087|                 98|    176.9048|              127|
Ивангород              |       23|82.609%   |             44|    31158.6906|                212|       45.7217|                183|    205.7368|              150|
Щеглово                |       22|90.909%   |             18|    53484.0178|                 92|       50.8577|                116|    110.5000|               65|
Мга                    |       22|72.727%   |             55|    40881.5010|                147|       46.8409|                171|    165.8750|              114|
Новогорелово           |       20|100.000%  |              1|    67409.0080|                 49|       45.3955|                190|     17.9000|                4|
Вырица                 |       19|73.684%   |             53|    48202.3475|                114|       47.0474|                169|    241.7857|              173|
Сясьстрой              |       19|73.684%   |             53|    34183.2919|                193|       48.5895|                150|    174.3571|              123|
Вартемяги              |       19|94.737%   |              4|    64911.1612|                 55|       46.0053|                180|    247.9444|              177|
Зеленогорск            |       19|89.474%   |             22|   121119.5650|                  1|       57.8421|                 45|    188.1765|              136|
Синявино               |       18|77.778%   |             50|    48070.9389|                115|       61.3611|                 34|    234.1429|              167|
Кузьмоловский          |       18|83.333%   |             42|    68927.0762|                 46|       54.3167|                 70|    132.6000|               78|
Лесколово              |       17|82.353%   |             45|    51229.4221|                104|       53.0235|                 89|    208.7143|              154|
Новый Свет             |       17|82.353%   |             45|    48675.9577|                110|       48.7176|                146|    105.2857|               61|
Лодейное Поле          |       17|94.118%   |              5|    31534.6358|                209|       53.0294|                 86|    255.5625|              181|
Пикалёво               |       16|100.000%  |              1|    18696.9846|                265|       50.3687|                124|    139.3750|               84|
Понтонный              |       16|87.500%   |             28|    72113.1201|                 34|       43.1750|                214|    142.8571|               86|
Подпорожье             |       16|56.250%   |             61|    27044.8331|                240|       52.5250|                 96|    286.4444|              196|
Морозова               |       15|66.667%   |             58|    50782.3862|                105|       64.7867|                 22|    282.5000|              194|
Дубровка               |       15|86.667%   |             30|    52264.1578|                 96|       46.3000|                174|    142.6154|               85|
Бокситогорск           |       15|86.667%   |             30|    17457.3301|                271|       49.3467|                135|     96.0000|               50|
Токсово                |       15|86.667%   |             30|    73103.7362|                 32|       51.3547|                105|    161.1538|              106|
Рахья                  |       14|71.429%   |             56|    46945.8259|                120|       43.7786|                206|    145.2000|               88|
Бегуницы               |       13|100.000%  |              1|    36993.8215|                170|       55.4692|                 58|    184.8462|              134|
Горбунки               |       13|84.615%   |             40|    57021.9234|                 77|       54.3692|                 69|    164.2727|              111|
Сосново                |       13|53.846%   |             62|    49146.4633|                108|       49.5231|                134|    159.1429|              102|
Павлово                |       12|83.333%   |             42|    56805.8649|                 79|       40.5500|                234|    154.7000|               95|
Фёдоровское            |       12|83.333%   |             42|    60158.0775|                 65|       51.1000|                108|    279.1000|              190|
Каменногорск           |       12|83.333%   |             42|    28138.9377|                234|       48.3417|                155|    143.6000|               87|
Ульяновка              |       12|83.333%   |             42|    47491.1632|                116|       49.5917|                132|    229.0000|              161|
Аннино                 |       12|75.000%   |             52|    63661.4629|                 57|       49.7000|                130|    200.3333|              147|
Большие Колпаны        |       11|90.909%   |             18|    46315.1033|                124|       49.0636|                141|    115.4000|               67|
Гарболово              |       11|81.818%   |             46|    45258.1509|                128|       46.0909|                179|    191.5556|              140|
Мистолово              |       11|81.818%   |             46|    98549.9773|                  6|       48.0800|                158|    235.0000|              168|
Большая Ижора          |       11|81.818%   |             46|    51452.2457|                100|       47.7727|                160|    162.6667|              109|
Елизаветино            |       10|70.000%   |             57|    29903.2174|                224|       41.6900|                227|    347.0000|              210|
Колтуши                |       10|100.000%  |              1|    68144.4582|                 48|       43.9300|                203|    122.9000|               72|
Новая Ладога           |       10|70.000%   |             57|    37984.9367|                163|       50.5200|                119|     76.8571|               38|
Советский              |       10|80.000%   |             47|    43914.4459|                133|       48.5900|                149|    133.1250|               79|
Лебяжье                |        9|88.889%   |             24|    48479.4271|                113|       45.3444|                191|    207.8750|              153|
Русско-Высоцкое        |        9|88.889%   |             24|    54833.7261|                 85|       49.1556|                139|    313.2500|              203|
Малое Карлино          |        9|77.778%   |             50|    72107.0503|                 35|       44.6000|                199|    262.2857|              182|
Малое Верево           |        8|75.000%   |             52|    58672.7852|                 70|       48.4250|                153|    173.1667|              119|
Сельцо                 |        8|75.000%   |             52|    41166.9932|                145|       50.3875|                123|    241.5000|              172|
Войсковицы             |        8|87.500%   |             28|    41895.7471|                139|       55.7125|                 54|    288.2857|              197|
Низино                 |        8|100.000%  |              1|    60722.1943|                 63|       42.6375|                216|    304.1250|              199|
Назия                  |        8|100.000%  |              1|    30900.3225|                214|       45.0375|                194|    182.7500|              132|
Пудость                |        8|100.000%  |              1|    45196.2056|                129|       47.7000|                161|    161.0000|              105|
Приладожский           |        7|85.714%   |             35|    44674.9676|                131|       49.7714|                129|    175.6667|              126|
Сяськелево             |        7|100.000%  |              1|    34457.4090|                191|       49.2571|                138|    253.5714|              179|
Извара                 |        7|71.429%   |             56|    26926.4643|                241|       46.1143|                177|    271.0000|              187|
Первомайское           |        7|42.857%   |             64|    50549.9018|                106|       49.9000|                128|    524.0000|              230|
Ильичёво               |        7|71.429%   |             56|    79114.9833|                 19|       36.2000|                247|    165.4000|              113|
Мичуринское            |        7|85.714%   |             35|    48798.0781|                109|       45.2429|                192|    169.0000|              117|
Кальтино               |        7|85.714%   |             35|    69141.0446|                 43|       69.0571|                 15|    206.1667|              152|
Малые Колпаны          |        7|85.714%   |             35|    59139.5536|                 68|       55.2143|                 62|    175.0000|              124|
Куттузи                |        7|85.714%   |             35|    68817.2561|                 47|       53.0286|                 87|     95.3333|               49|
Кипень                 |        7|57.143%   |             60|    47406.1328|                117|       44.7857|                197|    298.7500|              198|
Тайцы                  |        6|50.000%   |             63|    61100.2773|                 61|       50.0833|                126|     95.3333|               49|
Важины                 |        6|66.667%   |             58|    20684.3372|                260|       46.6667|                172|     62.7500|               28|
Лаголово               |        6|33.333%   |             65|    56515.0013|                 81|       49.3333|                136|    155.5000|               97|
Светогорск             |        6|100.000%  |              1|    32597.0368|                201|       55.0833|                 64|    199.0000|              146|
Любань                 |        6|100.000%  |              1|    36243.7422|                178|       43.3833|                211|    123.5000|               73|
Стеклянный             |        6|100.000%  |              1|    53657.9382|                 89|       45.4667|                188|    281.8333|              193|
Приморск               |        6|83.333%   |             42|    42399.3652|                137|       53.2667|                 81|    101.6000|               58|
Кобринское             |        6|50.000%   |             63|    45475.9349|                127|       35.3500|                251|     72.3333|               35|
Сапёрный               |        6|83.333%   |             42|    67243.0163|                 50|       42.7667|                215|    392.0000|              217|
Батово                 |        6|83.333%   |             42|    31853.7751|                207|       49.2833|                137|     98.8000|               53|
Усть-Луга              |        5|80.000%   |             47|    41405.4625|                141|       39.0600|                238|    124.0000|               74|
Кузнечное              |        5|100.000%  |              1|    29205.6883|                227|       45.8000|                182|     64.2000|               31|
Углово                 |        5|100.000%  |              1|    51864.8688|                 97|       69.5200|                 14|    184.6000|              133|
Молодцово              |        5|80.000%   |             47|    41611.1344|                140|       42.0800|                222|    222.0000|              159|
Терволово              |        5|100.000%  |              1|    51235.4836|                103|       41.2000|                228|    214.6000|              155|
Гостилицы              |        5|80.000%   |             47|    46911.2398|                121|       50.9960|                113|    205.5000|              149|
Лопухинка              |        5|100.000%  |              1|    33450.9805|                198|       45.5000|                187|    178.2000|              128|
Белогорка              |        5|80.000%   |             47|    35391.3043|                183|       45.8000|                182|    161.5000|              107|
Оржицы                 |        5|100.000%  |              1|    47364.3680|                118|       51.7200|                102|    191.4000|              139|
Победа                 |        5|60.000%   |             59|    30824.6141|                216|       62.7920|                 28|    105.6667|               62|
Форносово              |        5|60.000%   |             59|    53578.2305|                 90|       45.7200|                184|     98.0000|               52|
Лесогорский            |        5|60.000%   |             59|    21774.7977|                255|       53.2400|                 82|    155.0000|               96|
Заневка                |        5|60.000%   |             59|    79077.4359|                 20|       62.9400|                 27|    278.3333|              189|
Кузьмолово             |        5|100.000%  |              1|    81607.1047|                 15|       55.5000|                 55|    195.8000|              142|
Селезнёво              |        5|100.000%  |              1|    39838.8344|                153|       48.6400|                148|     66.6000|               32|
Рябово                 |        4|100.000%  |              1|    31159.7617|                211|       55.4750|                 57|    498.7500|              228|
Нурма                  |        4|75.000%   |             52|    36485.9873|                175|       54.0500|                 71|     78.0000|               39|
Петровское             |        4|75.000%   |             52|    40169.5938|                150|       45.6000|                186|    336.6667|              208|
Зимитицы               |        4|100.000%  |              1|    30567.6001|                220|       49.0250|                142|    280.5000|              192|
Громово                |        4|75.000%   |             52|    31036.4521|                213|       52.0000|                 99|    137.6667|               82|
Никольский             |        4|75.000%   |             52|    18352.2227|                266|       48.6500|                147|    405.6667|              222|
Новый Учхоз            |        4|75.000%   |             52|    43625.9756|                134|       40.0250|                237|    198.6667|              145|
Дружная Горка          |        4|75.000%   |             52|    29044.4150|                229|       43.4500|                210|    336.3333|              207|
Пеники                 |        4|75.000%   |             52|    53667.7471|                 88|       56.7250|                 50|    101.3333|               57|
Яльгелево              |        4|75.000%   |             52|    54010.6162|                 87|       51.0250|                110|     33.6667|               10|
Мельниково             |        4|100.000%  |              1|    36927.1553|                171|       43.2500|                213|    235.2500|              169|
Разбегаево             |        4|50.000%   |             63|    48594.9902|                111|       36.9750|                245|    255.5000|              180|
Юкки                   |        4|75.000%   |             52|    77638.8096|                 23|       57.5000|                 46|    305.6667|              200|
Суйда                  |        4|100.000%  |              1|    32035.0898|                205|       55.4500|                 59|    402.5000|              220|
Калитино               |        4|50.000%   |             63|    34178.6494|                194|       42.5250|                218|     44.0000|               15|
Торфяное               |        4|100.000%  |              1|    41207.4941|                144|       47.5000|                162|    173.5000|              120|
Пудомяги               |        4|100.000%  |              1|    45186.1904|                130|       48.7750|                144|    284.5000|              195|
Войскорово             |        3|66.667%   |             58|    57405.1068|                 74|       34.8333|                253|    125.5000|               76|
Кикерино               |        3|100.000%  |              1|    34030.8372|                195|       79.0000|                  6|    181.3333|              130|
Песочный               |        3|100.000%  |              1|    74187.2878|                 27|       41.7667|                226|     89.6667|               47|
Агалатово              |        3|66.667%   |             58|    71078.7552|                 38|       40.9000|                231|     23.5000|                7|
Ефимовский             |        3|66.667%   |             58|    16050.1110|                277|       52.6333|                 93|    113.5000|               66|
Лисий Нос              |        3|100.000%  |              1|   100660.8151|                  5|       40.0667|                236|    518.0000|              229|
Ваганово               |        3|100.000%  |              1|    43116.5352|                135|       55.3333|                 60|    462.3333|              226|
Будогощь               |        3|100.000%  |              1|    28834.2894|                231|       51.8667|                100|    107.3333|               63|
Лукаши                 |        3|0.000%    |             66|    46146.2461|                125|       55.1667|                 63|            |              235|
Разметелево            |        3|100.000%  |              1|    60566.4089|                 64|       32.0667|                257|    266.6667|              185|
Парицы                 |        3|100.000%  |              1|    39887.1849|                151|       52.3667|                 97|     48.6667|               19|
Торосово               |        3|100.000%  |              1|    27280.1615|                239|       44.3000|                201|     52.0000|               21|
Торошковичи            |        3|0.000%    |             66|    18104.0150|                270|       47.4333|                164|            |              235|
Перово                 |        3|33.333%   |             65|    36662.9688|                173|       49.6667|                131|     96.0000|               50|
Кобралово              |        3|100.000%  |              1|    39043.4023|                156|       51.1000|                109|    398.3333|              219|
Вещево                 |        3|100.000%  |              1|    30890.2194|                215|       40.5667|                233|    221.6667|              158|
Гаврилово              |        3|100.000%  |              1|    30819.2741|                217|       43.4667|                209|    158.3333|              101|
Суходолье              |        3|100.000%  |              1|    36266.6732|                177|       45.7000|                185|    229.3333|              162|
Лампово                |        3|33.333%   |             65|    29074.0208|                228|       55.0000|                 65|    103.0000|               59|
Красный Бор            |        3|100.000%  |              1|    54196.6432|                 86|       38.8333|                240|     64.0000|               30|
Репино                 |        3|66.667%   |             58|   108075.7292|                  2|      125.5667|                  1|    470.5000|              227|
Рождествено            |        3|66.667%   |             58|    37733.1602|                164|       49.9667|                127|     99.0000|               54|
Поляны                 |        3|66.667%   |             58|    45784.9049|                126|       38.9667|                239|    229.5000|              163|
Запорожское            |        3|66.667%   |             58|    36014.4922|                180|       47.1667|                168|    153.5000|               93|
Старополье             |        3|100.000%  |              1|    11206.2210|                290|       41.1333|                229|     61.3333|               27|
Келози                 |        3|66.667%   |             58|    49941.4818|                107|       36.4667|                246|     72.0000|               34|
Плодовое               |        3|66.667%   |             58|    31895.2096|                206|       45.2333|                193|     35.5000|               11|
Аро                    |        3|66.667%   |             58|    51412.4206|                102|       63.4333|                 25|    137.0000|               81|
Заклинье               |        3|66.667%   |             58|    30324.2168|                222|       59.7667|                 36|     45.5000|               17|
Приветнинское          |        3|66.667%   |             58|    56767.5990|                 80|       45.4000|                189|    103.0000|               59|
Сумино                 |        2|50.000%   |             63|    24979.8467|                248|       55.2500|                 61|    418.0000|              224|
Свирь                  |        2|100.000%  |              1|    11481.4814|                289|       51.0000|                112|    166.0000|              115|
Пансионат Зелёный Бор  |        2|100.000%  |              1|    42618.2930|                136|       34.0500|                254|     60.5000|               25|
Старосиверская         |        2|100.000%  |              1|    37343.2666|                168|       44.9000|                196|     24.0000|                8|
Семрино                |        2|100.000%  |              1|    37518.9395|                166|       63.5000|                 24|    105.0000|               60|
Выскатка               |        2|100.000%  |              1|    12335.4810|                287|       47.0000|                170|     45.5000|               17|
Совхозный              |        2|100.000%  |              1|    12629.1294|                286|       41.0000|                230|    103.0000|               59|
Ям-Тесово              |        2|100.000%  |              1|    13711.5537|                281|       44.7500|                198|     82.5000|               41|
Молодёжное             |        2|100.000%  |              1|    78787.0664|                 22|       47.4500|                163|   1118.5000|              234|
Александровская        |        2|100.000%  |              1|    70262.8047|                 40|      118.5000|                  2|     78.5000|               40|
Старая Пустошь         |        2|100.000%  |              1|    67205.9277|                 51|       32.0500|                258|     63.0000|               29|
Усть-Ижора             |        2|100.000%  |              1|    65935.6699|                 53|       55.5000|                 56|    245.5000|              175|
Суоранда               |        2|100.000%  |              1|    60038.6094|                 66|       29.7000|                263|     54.0000|               22|
Паша                   |        2|100.000%  |              1|    28120.7881|                235|       46.1000|                178|     39.0000|               12|
Виллози                |        2|100.000%  |              1|    57310.9492|                 76|       64.7000|                 23|    147.0000|               89|
Красная Долина         |        2|100.000%  |              1|    30041.3008|                223|       41.8500|                224|    348.0000|              211|
Жилгородок             |        2|100.000%  |              1|    53575.7031|                 91|       68.1500|                 16|     43.0000|               14|
Ушаки                  |        2|100.000%  |              1|    51549.1797|                 99|       40.2500|                235|     33.0000|                9|
Барышево               |        2|100.000%  |              1|    31841.2158|                208|       62.6000|                 29|    252.5000|              178|
Вознесенье             |        2|100.000%  |              1|    32222.3545|                203|       46.2500|                175|    138.5000|               83|
Старая Малукса         |        2|100.000%  |              1|    34903.4746|                188|       54.5000|                 68|     44.0000|               15|
Старые Бегуницы        |        2|100.000%  |              1|    35350.2520|                184|       35.9000|                250|    120.0000|               70|
Копорье                |        2|50.000%   |             63|    46536.7969|                123|       54.0000|                 72|    266.0000|              184|
Котельский             |        2|50.000%   |             63|    25577.3428|                246|       59.1000|                 39|     45.0000|               16|
Глинка                 |        2|50.000%   |             63|    52675.9707|                 95|       91.5000|                  4|    324.0000|              206|
Коробицыно             |        2|50.000%   |             63|    36770.7549|                172|       58.4500|                 42|    750.0000|              231|
Починок                |        2|50.000%   |             63|    33879.4932|                197|       43.5000|                208|    311.0000|              202|
Старая Ладога          |        2|50.000%   |             63|    34696.9707|                190|       42.5000|                219|     45.0000|               16|
Оредеж                 |        2|50.000%   |             63|    16622.7324|                273|       66.0500|                 20|     72.0000|               34|
Лесное                 |        2|50.000%   |             63|    42023.2324|                138|       63.3000|                 26|    161.0000|              105|
Коркино                |        2|0.000%    |             66|    20909.3730|                258|       31.1500|                260|            |              235|

*/

